app/controllers/pastes_controller.rb

SELECT "pastes".* FROM "pastes" ORDER BY created_at DESC
---
  def new

    #@paste = Paste.new
    #@paste = current_user.pastes.build
    @pastes = Paste.all.order("created_at DESC")

INSERT INTO "pastes" ("title", "description", "created_at", "updated_at", "user_id", "user_email") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Untitledwwww"], ["description", "wwwww"], ["created_at", 2017-04-27 18:23:44 UTC], ["updated_at", 2017-04-27 18:23:44 UTC], ["user_id", 1], ["user_email", "example@example.com"]]
SELECT  "pastes".* FROM "pastes" ORDER BY "pastes"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create

    #@paste = Paste.new(paste_params)
    @paste = current_or_guest_user.pastes.build(paste_params)
    @paste.user_email = current_or_guest_user.email
    @paste.username = current_or_guest_user.username

    if @paste.save
      redirect_to Paste.last

SELECT  "pastes".* FROM "pastes" WHERE "pastes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @paste = Paste.find(params[:id])

SELECT "pastes".* FROM "pastes" ORDER BY created_at DESC
---
  def trends
    @pastes = Paste.all.order("created_at DESC")

SELECT  "pastes".* FROM "pastes" WHERE "pastes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @paste = Paste.find(params[:id])

SELECT  "pastes".* FROM "pastes" WHERE "pastes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pastes" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pastes"."id" = ?  [["title", "UntitledqQQQQQQQQQQ"], ["description", "xeedeedeqqqqqq"], ["updated_at", 2017-05-04 17:18:05 UTC], ["id", 2]]
---
  def update
    @paste = Paste.find(params[:id])
    if @paste.update(paste_params)

DELETE FROM "pastes" WHERE "pastes"."id" = ?  [["id", 2]]
---
  def destroy
    @paste.destroy