app/controllers/users_controller.rb

SELECT "pastes".* FROM "pastes" ORDER BY created_at DESC
---
def show
  @profile = current_user
  @pastes = Paste.all.order("created_at DESC")